<template>
    <div class="about">
        <p>Добро пожаловать на сайт <b>aamakarenko.ru</b> - по сути техно- кодо- программистский блог, который запустился в марте-апреле 2025 года. По факту - живой архив моих знаний, заметок, конспектов, шпаргалок и т.п., который растёт вместе со мной. Ниже на странице располагаются планы на будущее, а также фиксируется процесс развития.</p>
        <hr><br>
        <ul>
            <li>🛠️ <b>Python (FastAPI): </b>Статья про проект REST API (UnivercityAPI)</li>
            <li>🛠️ <b>Python: </b>Основы асинхронного программирования на языке</li>
            <li>📝 <b>Грокаем алгоритмы: </b>Дописать</li>
            <li>📝 <b>Golang: </b>Статья про проект gRPC API. Игра "Подбрасывание кубика". Доработать</li>
            <br><hr><br>
            <li>✅ <b>Реляционные БД: </b>Основы проектирования</li>
            <li>✅ <b>Грокаем алгоритмы: </b>Статья, первая часть</li>
            <li>✅ <b>Golang: </b>Статья про проект gRPC API. (игра "Подбрасывание кубика")</li>
            <li>✅ <b>Golang:</b> Статья про приложение gRPC API (SSO Auth)</li>
            <li>✅ <b>Golang:</b> Статья про приложение REST API (URL-Shortener)</li>
            <li>✅ <b>Vue 3:</b> Основы, формы, компоненты</li>
        </ul>
    </div>
</template> 

<style scoped lang="scss">
.about {
    max-width: 777px;
    margin: 1rem auto;
    padding: 0 1rem;
    p {
        margin: 1rem auto;
        line-height: 1.8;
        color: #34495e;
    }
    ul {
        margin-left: 1rem;
    }
}
</style>
