<template>
    <div class="about">
        <p>Добро пожаловать на сайт <b>aamakarenko.ru</b> - по сути техно- кодо- программистский блог, который запустился в марте-апреле 2025 года. По факту - живой архив моих знаний, заметок, конспектов, шпаргалок и т.п., который растёт вместе со мной. Ниже на странице располагаются планы на будущее, а также фиксируется процесс развития.</p>
        <ul>
            <li>🛠️ <b>Грокаем алгоритмы: </b>Статья, вторая часть</li>
            <li>📝 <b>Go: </b>Статья про проект gRPC API. Игра "Подбрасывание кубика". Доработки</li>
            <li>📝 <b>Vue 3: </b>Статья с примером простого приложения</li>
            <br><hr><br>
            <li>✅ <b>Реляционные базы данных: </b>Основы проектирования</li>
            <li>✅ <b>Грокаем алгоритмы: </b>Статья, первая часть</li>
            <li>✅ <b>Go: </b>Статья про проект gRPC API. Игра "Подбрасывание кубика". Первая итерация</li>
            <li>✅ <b>Go:</b> Статья про приложение gRPC API (SSO Auth).</li>
            <li>✅ <b>Go:</b> Статья про приложение REST API (URL-Shortener).</li>
            <li>✅ <b>Vue 3:</b> Основы, формы, компоненты.</li>
        </ul>
    </div>
</template>

<style scoped lang="scss">
.about {
    max-width: 777px;
    margin: 1rem auto;
    padding: 0 1rem;
    p {
        margin: 1rem auto;
        line-height: 1.8;
        color: #34495e;
    }
    ul {
        margin-left: 1rem;
    }
}
</style>
